let centers =  {"Майкоп": [44.6098268, 40.1006606],
                "Горно-Алтайск": [51.9581028, 85.9603235],
                "Барнаул": [53.3479968, 83.7798064],
                "Бийск": [52.5393864, 85.2138453],
                "Рубцовск": [51.5012067, 81.2078695],
                "Благовещенск": [50.290659, 127.527198],
                "Архангельск": [64.5394289, 40.5169606],
                "Северодвинск": [64.5625385, 39.8180934],
                "Астрахань": [46.3655652, 48.0559236],
                "Благовещенск": [55.0499867, 55.9553186],
                "Нефтекамск": [56.088377, 54.2483061],
                "Салават": [53.3616974, 55.9245224],
                "Стерлитамак": [53.6300864, 55.9317089],
                "Уфа": [54.734944, 55.9578468],
                "Белгород": [50.5976472, 36.5856652],
                "Брянск": [53.2419535, 34.3652146],
                "Улан-Удэ": [51.8335853, 107.5842223],
                "Александров": [56.391819, 38.7111123],
                "Владимир": [56.1280804, 40.4084376],
                "Гусь-Хрустальный": [55.6198751, 40.6579929],
                "Муром": [55.5630311, 42.0231362],
                "Волгоград": [48.7070042, 44.5170339],
                "Вологда": [59.2483905, 39.8355662],
                "Воронеж": [51.6593332, 39.1969229],
                "Махачкала": [42.9849159, 47.5047181],
                "Биробиджан": [48.7946446, 132.9217207],
                "Чита": [52.0340142, 113.4994],
                "Иваново": [56.9993792, 40.9728272],
                "Братск": [56.1513108, 101.6340035],
                "Иркутск": [52.2864036, 104.2807466],
                "Нальчик": [43.4845464, 43.60713],
                "Калининград": [54.7074702, 20.5073241],
                "Элиста": [46.3083344, 44.2702088],
                "Калуга": [54.5059848, 36.2516245],
                "Киров": [54.0790111, 34.3076201],
                "Обнинск": [55.0943144, 36.6121639],
                "Петропавловск-Камчатский": [53.036908, 158.6559254],
                "Черкесск": [44.2269425, 42.0466704],
                "Петрозаводск": [61.7891264, 34.3596434],
                "Кемерово": [55.3910651, 86.0467781],
                "Междуреченск": [53.6865289, 88.0702754],
                "Новокузнецк": [53.794315, 87.2142745],
                "Прокопьевск": [53.8604265, 86.7183577],
                "Киров": [58.6035264, 49.6679304],
                "Сыктывкар": [61.6686617, 50.8358151],
                "Кострома": [57.768, 40.927],
                "Анапа": [44.8950433, 37.3163282],
                "Армавир": [45.0012149, 41.1324168],
                "Геленджик": [44.5630007, 38.0790852],
                "Ейск": [46.71157, 38.2763895],
                "Краснодар": [45.0401604, 38.9759647],
                "Новороссийск": [44.7235026, 37.7686135],
                "Сочи": [43.5854551, 39.7231548],
                "Туапсе": [44.1105335, 39.0824904],
                "Ачинск": [56.253907, 90.4794397],
                "Железногорск": [56.2529035, 93.532273],
                "Красноярск": [56.0093879, 92.8524806],
                "Норильск": [69.3489978, 88.2009846],
                "Курган": [55.4443883, 65.3161963],
                "Железногорск": [52.3380202, 35.3516867],
                "Курск": [51.7303637, 36.1925603],
                "Липецк": [52.610249, 39.5947883],
                "Магадан": [59.5681332, 150.8084956],
                "Йошкар-Ола": [56.6343662, 47.8999706],
                "Саранск": [54.1809332, 45.1862632],
                "Москва": [55.7540471, 37.620405],
                "Долгопрудный": [55.9385999, 37.5101021],
                "Дубна": [56.741786, 37.1757223],
                "Пущино": [54.8324412, 37.6210346],
                "Мурманск": [69.007721, 33.0685865],
                "Дзержинск": [56.2376047, 43.4599416],
                "Нижний Новгород": [56.3240627, 44.0053913],
                "Саров": [54.9228268, 43.3448089],
                "Великий Новгород": [58.5213846, 31.2755394],
                "Бердск": [54.7582156, 83.1070605],
                "Новосибирск": [55.028191, 82.9211489],
                "Омск": [54.9848566, 73.3674517],
                "Оренбург": [51.7875092, 55.1018828],
                "Орёл": [52.9671298, 36.0696427],
                "Пенза": [53.1753314, 45.0348625],
                "Пермь": [58.0102583, 56.2342034],
                "Владивосток": [43.1164904, 131.8823937],
                "Находка": [42.8239372, 132.8927361],
                "Уссурийск": [43.7971818, 131.9518229],
                "Великие Луки": [56.332208, 30.5508641],
                "Псков": [57.8194415, 28.3317198],
                "Волгодонск": [47.5165338, 42.1984951],
                "Каменск-Шахтинский": [48.3205326, 40.2689583],
                "Новочеркасск": [47.411919, 40.1042098],
                "Ростов-на-Дону": [47.2224566, 39.718803],
                "Таганрог": [47.2094917, 38.9350989],
                "Шахты": [47.7085287, 40.2159846],
                "Рязань": [54.6254445, 39.7358609],
                "Жигулевск": [53.4011981, 49.4945176],
                "Самара": [53.1950306, 50.1069518],
                "Сызрань": [53.1558674, 48.4744629],
                "Тольятти": [53.5205348, 49.3894028],
                "Санкт-Петербург": [59.9391313, 30.2159004],
                "Балаково": [52.0224231, 47.7827765],
                "Саратов": [51.533557, 46.034257],
                "Южно-Сахалинск": [46.9591631, 142.737976],
                "Екатеринбург": [56.8385216, 60.6054911],
                "Каменск-Уральский": [56.414962, 61.9188674],
                "Нижний Тагил": [57.910126, 59.9812853],
                "Новоуральск": [57.2472567, 60.0956714],
                "Первоуральск": [56.9080085, 59.942926],
                "Владикавказ": [43.020588, 44.6819182],
                "Смоленск": [54.782635, 32.045251],
                "Ессентуки": [44.0446186, 42.8588653],
                "Кисловодск": [43.9052044, 42.7168721],
                "Минеральные Воды": [44.2087273, 43.138408],
                "Пятигорск": [44.041091, 43.0661553],
                "Ставрополь": [45.044516, 41.9689655],
                "Тамбов": [52.7213154, 41.452264],
                "Казань": [55.7943584, 49.1114975],
                "Набережные Челны": [55.7434619, 52.3959165],
                "Нижнекамск": [55.6313609, 51.8144669],
                "Тверь": [56.8586059, 35.9116761],
                "Тула": [54.1920559, 37.6153842],
                "Кызыл": [51.7191047, 94.4376882],
                "Тобольск": [58.2017299, 68.2538558],
                "Тюмень": [57.1529744, 65.5344099],
                "Ижевск": [56.852738, 53.2114896],
                "Ульяновск": [54.3079415, 48.3748487],
                "Комсомольск-на-Амуре": [50.5498936, 137.0079408],
                "Хабаровск": [48.4647258, 135.0598942],
                "Абакан": [53.7223325, 91.4436721],
                "Нижневартовск": [60.9396698, 76.5696184],
                "Сургут": [61.2541083, 73.3961587],
                "Ханты-Мансийск": [61.0023984, 69.0184798],
                "Магнитогорск": [53.4072153, 58.9791437],
                "Снежинск": [56.0851495, 60.7324914],
                "Челябинск": [55.1602624, 61.4008078],
                "Грозный": [43.3180145, 45.698291],
                "Чебоксары": [56.1438298, 47.2489782],
                "Анадырь": [64.7313924, 177.5015421],
                "Якутск": [62.0281405, 129.7325887],
                "Салехард": [66.5492077, 66.6085318],
                "Ярославль": [57.6215477, 39.8977411]}

let long;
let lati;
$(document).ready(function() {
    $("#loading").hide();
    $("#booking").hide();
    if (YMaps.location) {
        long = YMaps.location.longitude;
        lati = YMaps.location.latitude;
        getTemperature(long, lati, getDateString(new Date()));
    }
    else
        alert("Пожалуйста, разрешите доступ к использованию Вашей геопозиции!");
});

$("#select-city").on("change", function () {
    let cita = $("#select-city :selected").val();
    centersList = centers[cita]
    long = centersList[1];
    lati = centersList[0];
    getTemperature(long, lati, getDateString($("#trip_date").val()));
});

$("#trip_date").on("change", function () {
    getTemperature(long, lati, getDateString($("#trip_date").val()));
});

function getTemperature(longitude, latitude, dateRef) {
    let weatherRequest =
        {
            location: {
                longitude: longitude,
                latitude: latitude
            },
            date: dateRef
        }
    $.ajax({
        method: "POST",
        url: "http://localhost:8080/weather/getTemperature",
        data: JSON.stringify(weatherRequest),
        dataType : "json",
        contentType: "application/json",
        success: function(data) {
            $(".weather__temp-number").val(data[0]);

            let size  = $(".weather__temp-number").val().length;
            if (size === 1) {
                $(".weather__temp input[type=number]").css("width", 15);
            }
            if (size === 2) {
                $(".weather__temp input[type=number]").css("width", 28);
            }
            if (size === 3) {
                $(".weather__temp input[type=number]").css("width", 38);
            }
        }
    });
}

function getDateString(dateRaw) {
    try {
        let day = dateRaw.getDate();
        if (day < 10) {
            day = "0" + day.toString();
        } else {
            day = day.toString();
        }
        let month = dateRaw.getMonth() + 1;
        if (month < 10) {
            month = 0 + month.toString();
        } else {
            month = month.toString();
        }
        return dateRaw.getFullYear().toString() + "-" +
            month + "-" + day;
    } catch {
        return dateRaw;
    }
}
